In [ ]:
# Creating a Pandas dataframe using list

In [8]:
import pandas as pd

lst = [1,8,5,6,7,3]
df = pd.DataFrame(lst)
print(df)

   0
0  1
1  8
2  5
3  6
4  7
5  3

In [12]:
# Creating dataframe from dict

import pandas as pd
 
data = {'Name':['vishal', 'sam', 'krish', 'sandy'],
        'Age':[20, 21, 19, 18]}

df = pd.DataFrame(data)
print(df)
print()
print(df.loc[0])    #  the loc attribute to return one or more specified row
print()
print(df.loc[[0,1]])

     Name  Age
0  vishal   20
1     sam   21
2   krish   19
3   sandy   18

Name    vishal
Age         20
Name: 0, dtype: object

     Name  Age
0  vishal   20
1     sam   21

In [4]:
# dealing with row and column
# column selection

import pandas as pd
 
data = {'Name':['Vishal','Gaurav', 'Anuj'],
        'Age':[27, 24 , 32],
        'Address':['Chandigarh', 'Hamirpur', 'Himachal',],
        'Qualification':['MCA', 'Msc', 'Phd']}

df = pd.DataFrame(data)
df[df.columns[1:4]]     # select multiple column

# print(df[['Name', 'Qualification']]) # selecting two column

   Age     Address Qualification
0   27  Chandigarh           MCA
1   24    Hamirpur           Msc
2   32    Himachal           Phd

In [5]:
# Panda Series : A Pandas Series is like a column in a table.
# It is a one-dimensional array holding data of any type.

import pandas as pd

a = [1, 7, 2]

df = pd.Series(a)
print(df)

0    1
1    7
2    2
dtype: int64

In [ ]:
# use to_string() to print the entire DataFrame.

In [ ]:
# Select Multiple Columns in a Pandas Dataframe using loc[]

In [7]:
import pandas as pd
 
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
df = pd.DataFrame(data)
 
# select three rows and two columns
df.loc[1:3, ['Name', 'Qualification']]
# df.loc[0, :]

     Name Qualification
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd

In [8]:
# Select Multiple Columns in Pandas using iloc[]
# Select first two column

import pandas as pd

data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
df = pd.DataFrame(data)
 
# Remember that Python does not
# slice inclusive of the ending index.
# select all rows 
# select first two column
df.iloc[:, 0:2]  # pass row and column

     Name  Age
0     Jai   27
1  Princi   24
2  Gaurav   22
3    Anuj   32

In [ ]:
# add a column in pandas dataframe

In [10]:
import pandas as pd

data = {'Name': ['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Height': [5.1, 6.2, 5.1, 5.2],
        'Qualification': ['Msc', 'MA', 'Msc', 'Msc']}

df = pd.DataFrame(data)

address = ['Delhi', 'Bangalore', 'Chennai', 'Patna']

df['Address'] = address
print(df)

     Name  Height Qualification    Address
0     Jai     5.1           Msc      Delhi
1  Princi     6.2            MA  Bangalore
2  Gaurav     5.1           Msc    Chennai
3    Anuj     5.2           Msc      Patna

In [ ]:
#Rename multiple columns.

In [15]:
 import pandas as pd 

rankings = {'test': ['India', 'South Africa', 'England', 
                            'New Zealand', 'Australia'], 
              'odi': ['England', 'India', 'New Zealand', 
                            'South Africa', 'Pakistan'], 
               't20': ['Pakistan', 'India', 'Australia', 
                              'England', 'New Zealand']} 
    
rankings_pd = pd.DataFrame(rankings) 
print(rankings_pd.columns) 
   
rankings_pd.rename(columns = {'test':'TEST', 'odi':'ODI', 
                              't20':'T20'}, inplace = True) 

# rankings_pd.columns = ['TEST', 'ODI', 'T-20'] .#By assigning a list of new column names 
print(rankings_pd.columns)

Index(['test', 'odi', 't20'], dtype='object')
Index(['TEST', 'ODI', 'T20'], dtype='object')

In [ ]:
# Dataframe Drop Column in Pandas using df.drop() Method

In [17]:
import pandas as pd

data = {
    'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
    'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
    'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
    'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
    'E': ['E1', 'E2', 'E3', 'E4', 'E5']}
 
df = pd.DataFrame(data)
# df.drop(['C', 'D'], axis=1)
 
# df.drop(columns =['C', 'D'])
# Remove three columns as index base
df.drop(df.columns[[0, 4, 2]], axis=1, inplace=True)
df

    B   D
0  B1  D1
1  B2  D2
2  B3  D3
3  B4  D4
4  B5  D5

In [ ]:
# Dataframe Drop Columns in Pandas using df.iloc[] Method

In [18]:
import pandas as pd
data = {
    'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
    'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
    'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
    'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
    'E': ['E1', 'E2', 'E3', 'E4', 'E5']}
 
df = pd.DataFrame(data)
# Remove all columns between column index 1 to 3
df.drop(df.iloc[:, 1:3], inplace=True, axis=1)
df

    A   D   E
0  A1  D1  E1
1  A2  D2  E2
2  A3  D3  E3
3  A4  D4  E4
4  A5  D5  E5

In [19]:
# Dataframe Drop Columns in Pandas using df.loc[] Method

In [20]:
import pandas as pd
data = {
    'A': ['A1', 'A2', 'A3', 'A4', 'A5'],
    'B': ['B1', 'B2', 'B3', 'B4', 'B5'],
    'C': ['C1', 'C2', 'C3', 'C4', 'C5'],
    'D': ['D1', 'D2', 'D3', 'D4', 'D5'],
    'E': ['E1', 'E2', 'E3', 'E4', 'E5']}
 
df = pd.DataFrame(data)
# Remove all columns between column name 'B' to 'D'
df.drop(df.loc[:, 'B':'D'].columns, axis=1)

    A   E
0  A1  E1
1  A2  E2
2  A3  E3
3  A4  E4
4  A5  E5